src/Documents/НачислениеОклада/НачислениеОклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеОклада</name>
  <registerRecords>CalculationRegister.Начисления</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействияНачало</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействияКонец</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаОклада</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/CalculationRegisters/Начисления/Начисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Начисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ПроизводственныйКалендарь</schedule>
  <scheduleValue>InformationRegister.ПроизводственныйКалендарь.Resource.РабочийДень</scheduleValue>
  <scheduleDate>InformationRegister.ПроизводственныйКалендарь.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.Начисления</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Параметр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>График</name>
    <type>
      <types>CatalogRef.Графики</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <recalculations>
    <name>Перерасчет1</name>
  </recalculations>
</mdclass:CalculationRegister>

src/Documents/НачислениеОклада/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Начисления
	Движения.Начисления.Записывать = Истина;
	Движение = Движения.Начисления.Добавить();
	//Движение.Сторно = Ложь;
	Движение.ПериодДействияНачало = ПериодДействияНачало;
	Движение.ПериодДействияКонец = ПериодДействияКонец;
	Движение.ПериодРегистрации = Дата;
	Движение.Сотрудник = Сотрудник;  
	Движение.ВидРасчета = ПланыВидовРасчета.Начисления.Оклад;  
	Движение.Параметр = СтавкаОклада;  
	
	Движения.Начисления.Записать(); 
	
	Запись = Движения.Начисления[0];
	
	Норма = Запись.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ПериодДействия)[0].Признак;
	Факт = Запись.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ФактическийПериодДействия)[0].Признак; 
	
	Сумма = Факт / Норма * Запись.СтавкаОклада;
	
	
	Движения.Начисления.Записать();

КонецПроцедуры
